In [2]:
# Installation of psycopg2
pip install psycopg2

Collecting psycopg2
  Downloading psycopg2-2.9.10-cp312-cp312-win_amd64.whl.metadata (5.0 kB)
Downloading psycopg2-2.9.10-cp312-cp312-win_amd64.whl (1.2 MB)
   ---------------------------------------- 0.0/1.2 MB ? eta -:--:--
   ---------------------------------------- 1.2/1.2 MB 14.3 MB/s eta 0:00:00
Installing collected packages: psycopg2
Successfully installed psycopg2-2.9.10
Note: you may need to restart the kernel to use updated packages.

In [3]:
# Importing packages
import pandas as pd
import psycopg2

In [52]:
# DB connection setup using hardcoded credentials (for onboarding only)
conn = psycopg2.connect(
    dbname="neondb",
    user="neondb_owner",
    password="npg_CeS9fJg2azZD",
    host="ep-falling-glitter-a5m0j5gk-pooler.us-east-2.aws.neon.tech",
    port="5432",
    sslmode="require"
)
cur = conn.cursor()
# Sample query
query = "SELECT * FROM nyc_schools.high_school_directory;"
df = pd.read_sql(query, conn)
df.head()

In [54]:
# DB connection setup using hardcoded credentials (for onboarding only)
conn = psycopg2.connect(
    dbname="neondb",
    user="neondb_owner",
    password="npg_CeS9fJg2azZD",
    host="ep-falling-glitter-a5m0j5gk-pooler.us-east-2.aws.neon.tech",
    port="5432",
    sslmode="require"
)
cur = conn.cursor()
# How many schools are there in each borough?
query = """
SELECT borough, 
COUNT(DISTINCT dbn) as school_count 
FROM nyc_schools.high_school_directory 
GROUP BY borough;
"""
df = pd.read_sql(query, conn)
print("Number of schools in each borough")
df.head()

C:\Users\nayan\AppData\Local\Temp\ipykernel_19192\2532204041.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

Number of schools in each borough

         borough  school_count
0          Bronx           118
1       Brooklyn           121
2      Manhattan           106
3         Queens            80
4  Staten Island            10

In [56]:
conn = psycopg2.connect(
    dbname="neondb",
    user="neondb_owner",
    password="npg_CeS9fJg2azZD",
    host="ep-falling-glitter-a5m0j5gk-pooler.us-east-2.aws.neon.tech",
    port="5432",
    sslmode="require"
)
cur = conn.cursor()
#What is the average % of English Language Learners (ELL) per borough?
query = """
SELECT HS.borough, AVG(CAST(SD.ell_percent AS FLOAT)) AS avg_ell_per
FROM nyc_schools.high_school_directory AS HS
INNER JOIN nyc_schools.school_demographics AS SD
ON HS.dbn = SD.dbn
GROUP BY HS.borough;
"""
df = pd.read_sql(query, conn)
print("% of English Language Learners (ELL) per borough")
df.head()

C:\Users\nayan\AppData\Local\Temp\ipykernel_19192\2719942440.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

% of English Language Learners (ELL) per borough

     borough  avg_ell_per
0  Manhattan       7.5725

In [48]:
conn = psycopg2.connect(
    dbname="neondb",
    user="neondb_owner",
    password="npg_CeS9fJg2azZD",
    host="ep-falling-glitter-a5m0j5gk-pooler.us-east-2.aws.neon.tech",
    port="5432",
    sslmode="require"
)
cur = conn.cursor()
query = """
SELECT HS.borough, AVG(CAST(SD.sped_percent AS FLOAT)) AS avg_sped_percent
FROM nyc_schools.high_school_directory AS HS
INNER JOIN nyc_schools.school_demographics AS SD
ON HS.dbn = SD.dbn
GROUP BY HS.borough;
"""
df = pd.read_sql(query, conn)
df.head()

C:\Users\nayan\AppData\Local\Temp\ipykernel_19192\214338277.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

     borough  avg_sped_percent
0  Manhattan            16.755

In [51]:
conn = psycopg2.connect(
    dbname="neondb",
    user="neondb_owner",
    password="npg_CeS9fJg2azZD",
    host="ep-falling-glitter-a5m0j5gk-pooler.us-east-2.aws.neon.tech",
    port="5432",
    sslmode="require"
)
cur = conn.cursor()
# Using the data from the school demographics and high school directory, write a query to find the top 3 schools in each borough with the highest percentage of special education students (sped_percent)
query = """
SELECT *
FROM (
    SELECT 
        HS.dbn,
        HS.school_name,
        HS.borough,
        CAST(SD.sped_percent AS FLOAT) AS sped_percent,
        ROW_NUMBER() OVER (PARTITION BY HS.borough ORDER BY CAST(SD.sped_percent AS FLOAT) DESC) AS rank
    FROM nyc_schools.high_school_directory AS HS
    JOIN nyc_schools.school_demographics AS SD
    ON HS.dbn = SD.dbn
) AS ranked
WHERE rank <= 3;
"""
df = pd.read_sql(query, conn) 
print("top 3 schools in each borough with the highest percentage of special education students (sped_percent))

df.head()

C:\Users\nayan\AppData\Local\Temp\ipykernel_19192\598187106.py:25: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

      dbn                 school_name    borough  sped_percent  rank
0  01M450  East Side Community School  Manhattan     28.799999     1
1  01M450  East Side Community School  Manhattan     27.700001     2
2  01M450  East Side Community School  Manhattan     26.700001     3